app/views/references/_attributes_form.html.erb

		<div class="col-md-4">
			<%= select_tag "reference_attribute[name]", options_for_select(attributes, attributes.first), class: "form-control" %>
---
SELECT "reference_attributes".* FROM "reference_attributes" WHERE "reference_attributes"."reference_id" = ?  [["reference_id", 4]]