app/views/references/_book_attributes_form.html.erb

SELECT "reference_attributes".* FROM "reference_attributes" WHERE "reference_attributes"."reference_id" = ?  [["reference_id", 1]]
---
		<div class="col-md-4">
			<%= select_tag "reference_attribute[name]", options_for_select(attributes, attributes.first), class: "form-control" %>