app/views/references/_edit_attributes_form.html.erb

SELECT "reference_attributes".* FROM "reference_attributes" WHERE "reference_attributes"."reference_id" = ?  [["reference_id", 1]]
---
	<tbody>
		<% reference.reference_attributes.each do |attribute| %>