app/views/references/show.html.erb

<h2>Attributes</h2>
<% if @reference.reference_attributes.empty? %>
---
SELECT "reference_attributes".* FROM "reference_attributes" WHERE "reference_attributes"."reference_id" = ?  [["reference_id", 1]]
SELECT 1 AS one FROM "reference_attributes" WHERE "reference_attributes"."reference_id" = ? LIMIT 1  [["reference_id", 1]]