app/controllers/reference_attributes_controller.rb

SELECT "reference_attributes".* FROM "reference_attributes"
---
  def index
    @reference_attributes = ReferenceAttribute.all

INSERT INTO "reference_attributes" ("created_at", "name", "reference_id", "updated_at", "value") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 28 Mar 2014 17:54:28 UTC +00:00], ["name", "title"], ["reference_id", 1], ["updated_at", Fri, 28 Mar 2014 17:54:28 UTC +00:00], ["value", "kallen kalakirja"]]
---
  def create
    @reference_attribute = ReferenceAttribute.new(reference_attribute_params)
    respond_to do |format|
      if @reference_attribute.save