app/controllers/references_controller.rb

  def index
    @references = Reference.all
---
SELECT "references".* FROM "references"

  def create
    @reference = Reference.new(reference_params)
    @attributes = params.require(:attribute)
    add_attributes(@reference, @attributes)
    if @reference.save
---
INSERT INTO "references" ("created_at", "name", "ref_type", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 28 Mar 2014 16:51:23 UTC +00:00], ["name", "kirja1"], ["ref_type", "book"], ["updated_at", Fri, 28 Mar 2014 16:51:23 UTC +00:00]]

  def update
    respond_to do |format|
      if @reference.update(params.require(:reference).permit(:name))
---
UPDATE "references" SET "name" = ?, "updated_at" = ? WHERE "references"."id" = 2  [["name", "kirja5"], ["updated_at", Tue, 01 Apr 2014 06:43:14 UTC +00:00]]

  def destroy
    @reference.destroy
---
DELETE FROM "references" WHERE "references"."id" = ?  [["id", 5]]

  def download_bibtex
    references = Reference.includes(:reference_attributes).all
---
SELECT "reference_attributes".* FROM "reference_attributes" WHERE "reference_attributes"."reference_id" IN (1, 2, 3, 4, 6, 7)
SELECT "references".* FROM "references"

    def set_reference
      @reference = Reference.find(params[:id])
---
SELECT "references".* FROM "references" WHERE "references"."id" = ? LIMIT 1  [["id", "5"]]